---
kind: method
id: M:Autodesk.Revit.DB.KeynoteTable.GetKeynoteTable(Autodesk.Revit.DB.Document)
source: html/49063d10-0a36-acb4-0b7b-646e87f367c3.htm
---
# Autodesk.Revit.DB.KeynoteTable.GetKeynoteTable Method

Gets the KeynoteTable from a Revit document.

## Syntax (C#)
```csharp
public static KeynoteTable GetKeynoteTable(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The Revit document.

## Returns
The KeynoteTable.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null